Revit 2026 API

# UpdaterId Methods

---

The UpdaterId type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetAddInId | AddInId of the UpdaterId |
|  | GetGUID | GUID value of the UpdaterId |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

UpdaterId Class

Autodesk.Revit.DB Namespace